STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
/**
 ******************************************************************************
 * @file   matd.c
 * @author SRA AI Application Team
 * @brief  STM32 Image Processing Library - matd module
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * Portions of this file are part of the OpenMV project.
 *
 * Copyright (c) 2013-2019 Ibrahim Abdelkader <iabdalkader@openmv.io>
 * Copyright (c) 2013-2019 Kwabena W. Agyeman <kwagyeman@openmv.io>
 * Copyright (c) 2013-2016 The Regents of The University of Michigan
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* This file has been created for STM32IPL and contains code moved here from
 * apriltag.c file.
 */

#include "matd.h"
#include "stm32ipl_mem_alloc.h" // STM32IPL

#define fprintf(format, ...)
#define free(ptr) ({ umm_free(ptr); })
#define malloc(size) ({ void *_r = umm_malloc(size); if(!_r) umm_alloc_fail(); _r; })
#define realloc(ptr, size) ({ void *_r = umm_realloc((ptr), (size)); if(!_r) umm_alloc_fail(); _r; })
#define calloc(num, item_size) ({ void *_r = umm_calloc((num), (item_size)); if(!_r) umm_alloc_fail(); _r; })
// STM32IPL #define assert(expression)
#define sqrt(x) fast_sqrtf(x)
#define sqrtf(x) fast_sqrtf(x)
// STM32IPL #define floor(x) fast_floorf(x)
#define floorf(x) fast_floorf(x)
#define ceil(x) fast_ceilf(x)
#define ceilf(x) fast_ceilf(x)
#define round(x) fast_roundf(x)
#define roundf(x) fast_roundf(x)
#define atan(x) fast_atanf(x)
#define atanf(x) fast_atanf(x)
#define atan2(y, x) fast_atan2f((y), (x))
#define atan2f(y, x) fast_atan2f((y), (x))
#define exp(x) fast_expf(x)
#define expf(x) fast_expf(x)
#define cbrt(x) fast_cbrtf(x)
#define cbrtf(x) fast_cbrtf(x)
// STM32IPL #define fabs(x) fast_fabsf(x)
#define fabsf(x) fast_fabsf(x)
#define log(x) fast_log(x)
#define logf(x) fast_log(x)
#undef log2
#define log2(x) fast_log2(x)
#undef log2f
#define log2f(x) fast_log2(x)
#define sin(x) arm_sin_f32(x)
#define cos(x) arm_cos_f32(x)

#ifndef STM32IPL
#define fmin(a, b) ({ __typeof__ (a) _a = (a); __typeof__ (b) _b = (b); _a < _b ? _a : _b; })
#define fminf(a, b) ({ __typeof__ (a) _a = (a); __typeof__ (b) _b = (b); _a < _b ? _a : _b; })
#define fmax(a, b) ({ __typeof__ (a) _a = (a); __typeof__ (b) _b = (b); _a > _b ? _a : _b; })
#define fmaxf(a, b) ({ __typeof__ (a) _a = (a); __typeof__ (b) _b = (b); _a > _b ? _a : _b; })
#else
#define fmin(a, b)  ({ a < b ? a : b; })
#define fminf(a, b) ({ a < b ? a : b; })
#define fmax(a, b)  ({ a > b ? a : b; })
#define fmaxf(a, b) ({ a > b ? a : b; })
#endif // STM32IPL

////////////////////////////////////////////////////////////////////////////////////////////////////
//////// "svd22.c"
////////////////////////////////////////////////////////////////////////////////////////////////////

/** SVD 2x2.

 Computes singular values and vectors without squaring the input
 matrix. With double precision math, results are accurate to about
 1E-16.

 U = [ cos(theta) -sin(theta) ]
 [ sin(theta)  cos(theta) ]

 S = [ e  0 ]
 [ 0  f ]

 V = [ cos(phi)   -sin(phi) ]
 [ sin(phi)   cos(phi)  ]


 Our strategy is basically to analytically multiply everything out
 and then rearrange so that we can solve for theta, phi, e, and
 f. (Derivation by ebolson@umich.edu 5/2016)

 V' = [ CP  SP ]
 [ -SP CP ]

 USV' = [ CT -ST ][  e*CP  e*SP ]
 [ ST  CT ][ -f*SP  f*CP ]

 = [e*CT*CP + f*ST*SP     e*CT*SP - f*ST*CP ]
 [e*ST*CP - f*SP*CT     e*SP*ST + f*CP*CT ]

 A00+A11 = e*CT*CP + f*ST*SP + e*SP*ST + f*CP*CT
 = e*(CP*CT + SP*ST) + f*(SP*ST + CP*CT)
 = (e+f)(CP*CT + SP*ST)
 B0	    = (e+f)*cos(P-T)

 A00-A11 = e*CT*CP + f*ST*SP - e*SP*ST - f*CP*CT
 = e*(CP*CT - SP*ST) - f*(-ST*SP + CP*CT)
 = (e-f)(CP*CT - SP*ST)
 B1	    = (e-f)*cos(P+T)

 A01+A10 = e*CT*SP - f*ST*CP + e*ST*CP - f*SP*CT
 = e(CT*SP + ST*CP) - f*(ST*CP + SP*CT)
 = (e-f)*(CT*SP + ST*CP)
 B2	    = (e-f)*sin(P+T)

 A01-A10 = e*CT*SP - f*ST*CP - e*ST*CP + f*SP*CT
 = e*(CT*SP - ST*CP) + f(SP*CT - ST*CP)
 = (e+f)*(CT*SP - ST*CP)
 B3	= (e+f)*sin(P-T)

 B0 = (e+f)*cos(P-T)
 B1 = (e-f)*cos(P+T)
 B2 = (e-f)*sin(P+T)
 B3 = (e+f)*sin(P-T)

 B3/B0 = tan(P-T)

 B2/B1 = tan(P+T)
 **/
void svd22(const float A[4], float U[4], float S[2], float V[4])
{
	float A00 = A[0];
	float A01 = A[1];
	float A10 = A[2];
	float A11 = A[3];

	float B0 = A00 + A11;
	float B1 = A00 - A11;
	float B2 = A01 + A10;
	float B3 = A01 - A10;

	float PminusT = atan2(B3, B0);
	float PplusT = atan2(B2, B1);

	float P = (PminusT + PplusT) / 2;
	float T = (-PminusT + PplusT) / 2;

	float CP = cos(P), SP = sin(P);
	float CT = cos(T), ST = sin(T);

	U[0] = CT;
	U[1] = -ST;
	U[2] = ST;
	U[3] = CT;

	V[0] = CP;
	V[1] = -SP;
	V[2] = SP;
	V[3] = CP;

	// C0 = e+f. There are two ways to compute C0; we pick the one
	// that is better conditioned.
	float CPmT = cos(P - T), SPmT = sin(P - T);
	float C0 = 0;
	if (fabs(CPmT) > fabs(SPmT))
		C0 = B0 / CPmT;
	else
		C0 = B3 / SPmT;

	// C1 = e-f. There are two ways to compute C1; we pick the one
	// that is better conditioned.
	float CPpT = cos(P + T), SPpT = sin(P + T);
	float C1 = 0;
	if (fabs(CPpT) > fabs(SPpT))
		C1 = B1 / CPpT;
	else
		C1 = B2 / SPpT;

	// e and f are the singular values
	float e = (C0 + C1) / 2;
	float f = (C0 - C1) / 2;

	if (e < 0) {
		e = -e;
		U[0] = -U[0];
		U[2] = -U[2];
	}

	if (f < 0) {
		f = -f;
		U[1] = -U[1];
		U[3] = -U[3];
	}

	// sort singular values.
	if (e > f) {
		// already in big-to-small order.
		S[0] = e;
		S[1] = f;
	} else {
		// Curiously, this code never seems to get invoked.  Why is it
		// that S[0] always ends up the dominant vector?  However,
		// this code has been tested (flipping the logic forces us to
		// sort the singular values in ascending order).
		//
		// P = [ 0 1 ; 1 0 ]
		// USV' = (UP)(PSP)(PV')
		//      = (UP)(PSP)(VP)'
		//      = (UP)(PSP)(P'V')'
		S[0] = f;
		S[1] = e;

		// exchange columns of U and V
		float tmp[2];
		tmp[0] = U[0];
		tmp[1] = U[2];
		U[0] = U[1];
		U[2] = U[3];
		U[1] = tmp[0];
		U[3] = tmp[1];

		tmp[0] = V[0];
		tmp[1] = V[2];
		V[0] = V[1];
		V[2] = V[3];
		V[1] = tmp[0];
		V[3] = tmp[1];
	}

