STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
	/*
	 float SM[4] = { S[0], 0, 0, S[1] };

	 doubles_print_mat(U, 2, 2, "%20.10g");
	 doubles_print_mat(SM, 2, 2, "%20.10g");
	 doubles_print_mat(V, 2, 2, "%20.10g");
	 printf("A:\n");
	 doubles_print_mat(A, 2, 2, "%20.10g");

	 float SVt[4];
	 doubles_mat_ABt(SM, 2, 2, V, 2, 2, SVt, 2, 2);
	 float USVt[4];
	 doubles_mat_AB(U, 2, 2, SVt, 2, 2, USVt, 2, 2);

	 printf("USVt\n");
	 doubles_print_mat(USVt, 2, 2, "%20.10g");

	 float diff[4];
	 for (int i = 0; i < 4; i++)
	 diff[i] = A[i] - USVt[i];

	 printf("diff\n");
	 doubles_print_mat(diff, 2, 2, "%20.10g");

	 */

}

// for the matrix [a b; b d]
void svd_sym_singular_values(float A00, float A01, float A11, float *Lmin, float *Lmax)
{
	float A10 = A01;

	float B0 = A00 + A11;
	float B1 = A00 - A11;
	float B2 = A01 + A10;
	float B3 = A01 - A10;

	float PminusT = atan2(B3, B0);
	float PplusT = atan2(B2, B1);

	float P = (PminusT + PplusT) / 2;
	float T = (-PminusT + PplusT) / 2;

	// C0 = e+f. There are two ways to compute C0; we pick the one
	// that is better conditioned.
	float CPmT = cos(P - T), SPmT = sin(P - T);
	float C0 = 0;
	if (fabs(CPmT) > fabs(SPmT))
		C0 = B0 / CPmT;
	else
		C0 = B3 / SPmT;

	// C1 = e-f. There are two ways to compute C1; we pick the one
	// that is better conditioned.
	float CPpT = cos(P + T), SPpT = sin(P + T);
	float C1 = 0;
	if (fabs(CPpT) > fabs(SPpT))
		C1 = B1 / CPpT;
	else
		C1 = B2 / SPpT;

	// e and f are the singular values
	float e = (C0 + C1) / 2;
	float f = (C0 - C1) / 2;

	*Lmin = fmin(e, f);
	*Lmax = fmax(e, f);
}

////////////////////////////////////////////////////////////////////////////////////////////////////
//////// "matd.c"
////////////////////////////////////////////////////////////////////////////////////////////////////

// a matd_t with rows=0 cols=0 is a SCALAR.

// to ease creating mati, matf, etc. in the future.
#define TYPE float

matd_t* matd_create(int rows, int cols)
{
	assert(rows >= 0);
	assert(cols >= 0);

	if (rows == 0 || cols == 0)
		return matd_create_scalar(0);

	matd_t *m = calloc(1, sizeof(matd_t) + (rows * cols * sizeof(float)));
	m->nrows = rows;
	m->ncols = cols;

	return m;
}

matd_t* matd_create_scalar(TYPE v)
{
	matd_t *m = calloc(1, sizeof(matd_t) + sizeof(float));
	m->nrows = 0;
	m->ncols = 0;
	m->data[0] = v;

	return m;
}

matd_t* matd_create_data(int rows, int cols, const TYPE *data)
{
	if (rows == 0 || cols == 0)
		return matd_create_scalar(data[0]);

	matd_t *m = matd_create(rows, cols);
	for (int i = 0; i < rows * cols; i++)
		m->data[i] = data[i];

	return m;
}

matd_t* matd_create_dataf(int rows, int cols, const float *data)
{
	if (rows == 0 || cols == 0)
		return matd_create_scalar(data[0]);

	matd_t *m = matd_create(rows, cols);
	for (int i = 0; i < rows * cols; i++)
		m->data[i] = (float)data[i];

	return m;
}

matd_t* matd_identity(int dim)
{
	if (dim == 0)
		return matd_create_scalar(1);

	matd_t *m = matd_create(dim, dim);
	for (int i = 0; i < dim; i++)
		MATD_EL(m, i, i)= 1;

	return m;
}

// row and col are zero-based
TYPE matd_get(const matd_t *m, int row, int col)
{
	assert(m != NULL);assert(!matd_is_scalar(m));assert(row >= 0);assert(row < m->nrows);assert(col >= 0);assert(col < m->ncols);

	return MATD_EL(m, row, col);
}

// row and col are zero-based
void matd_put(matd_t *m, int row, int col, TYPE value)
{
	assert(m != NULL);

	if (matd_is_scalar(m)) {
		matd_put_scalar(m, value);
		return;
	}

	assert(row >= 0);assert(row < m->nrows);assert(col >= 0);assert(col < m->ncols);

	MATD_EL(m, row, col)= value;
}

TYPE matd_get_scalar(const matd_t *m)
{
	assert(m != NULL);assert(matd_is_scalar(m));

	return (m->data[0]);
}

void matd_put_scalar(matd_t *m, TYPE value)
{
	assert(m != NULL);assert(matd_is_scalar(m));

	m->data[0] = value;
}

matd_t* matd_copy(const matd_t *m)
{
	assert(m != NULL);

	matd_t *x = matd_create(m->nrows, m->ncols);
	if (matd_is_scalar(m))
		x->data[0] = m->data[0];
	else
		memcpy(x->data, m->data, sizeof(TYPE) * m->ncols * m->nrows);

	return x;
}

matd_t* matd_select(const matd_t *a, int r0, int r1, int c0, int c1)
{
	assert(a != NULL);

	assert(r0 >= 0 && r0 < a->nrows);assert(c0 >= 0 && c0 < a->ncols);

	int nrows = r1 - r0 + 1;
	int ncols = c1 - c0 + 1;

	matd_t *r = matd_create(nrows, ncols);

	for (int row = r0; row <= r1; row++)
		for (int col = c0; col <= c1; col++)
			MATD_EL(r,row-r0,col-c0)= MATD_EL(a,row,col);

	return r;
}

#ifndef STM32IPL
void matd_print(const matd_t *m, const char *fmt)
{
	assert(m != NULL); assert(fmt != NULL);

	if (matd_is_scalar(m)) {
		printf(fmt, (double)MATD_EL(m, 0, 0));
		printf("\n");
	} else {
		for (int i = 0; i < m->nrows; i++) {
			for (int j = 0; j < m->ncols; j++) {
				printf(fmt, (double)MATD_EL(m, i, j));
			}
			printf("\n");
		}
	}
}

void matd_print_transpose(const matd_t *m, const char *fmt)
{
	assert(m != NULL); assert(fmt != NULL);

	if (matd_is_scalar(m)) {
		printf(fmt, (double)MATD_EL(m, 0, 0));
		printf("\n");
	} else {
		for (int j = 0; j < m->ncols; j++) {
			for (int i = 0; i < m->nrows; i++) {
				printf(fmt, (double)MATD_EL(m, i, j));
			}
			printf("\n");
		}
	}
}
#endif  /* STM32IPL */

void matd_destroy(matd_t *m)
{
	if (!m)
		return;

	assert(m != NULL);
	free(m);
}

matd_t* matd_multiply(const matd_t *a, const matd_t *b)
{
	assert(a != NULL);assert(b != NULL);

	if (matd_is_scalar(a))
		return matd_scale(b, a->data[0]);
	if (matd_is_scalar(b))
		return matd_scale(a, b->data[0]);

	assert(a->ncols == b->nrows);
	matd_t *m = matd_create(a->nrows, b->ncols);

	for (int i = 0; i < m->nrows; i++) {
		for (int j = 0; j < m->ncols; j++) {
			TYPE acc = 0;
			for (int k = 0; k < a->ncols; k++) {
				acc += MATD_EL(a, i, k)* MATD_EL(b, k, j);
			}
			MATD_EL(m, i, j)= acc;
		}
	}

	return m;
}

matd_t* matd_scale(const matd_t *a, float s)
{
	assert(a != NULL);

	if (matd_is_scalar(a))
		return matd_create_scalar(a->data[0] * s);

	matd_t *m = matd_create(a->nrows, a->ncols);

	for (int i = 0; i < m->nrows; i++) {
		for (int j = 0; j < m->ncols; j++) {
			MATD_EL(m, i, j)= s * MATD_EL(a, i, j);
		}
	}

	return m;
}

void matd_scale_inplace(matd_t *a, float s)
{
	assert(a != NULL);

	if (matd_is_scalar(a)) {
		a->data[0] *= s;
		return;
	}

	for (int i = 0; i < a->nrows; i++) {
		for (int j = 0; j < a->ncols; j++) {
			MATD_EL(a, i, j)*= s;
		}
	}
}

matd_t* matd_add(const matd_t *a, const matd_t *b)
{
	assert(a != NULL);assert(b != NULL);assert(a->nrows == b->nrows);assert(a->ncols == b->ncols);

	if (matd_is_scalar(a))
		return matd_create_scalar(a->data[0] + b->data[0]);

	matd_t *m = matd_create(a->nrows, a->ncols);

	for (int i = 0; i < m->nrows; i++) {
		for (int j = 0; j < m->ncols; j++) {
			MATD_EL(m, i, j)= MATD_EL(a, i, j) + MATD_EL(b, i, j);
		}
	}

	return m;
}

void matd_add_inplace(matd_t *a, const matd_t *b)
{
	assert(a != NULL);assert(b != NULL);assert(a->nrows == b->nrows);assert(a->ncols == b->ncols);

	if (matd_is_scalar(a)) {
		a->data[0] += b->data[0];
		return;
	}

	for (int i = 0; i < a->nrows; i++) {
		for (int j = 0; j < a->ncols; j++) {
			MATD_EL(a, i, j)+= MATD_EL(b, i, j);
		}
	}
}

