STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
matd_t* matd_subtract(const matd_t *a, const matd_t *b)
{
	assert(a != NULL);assert(b != NULL);assert(a->nrows == b->nrows);assert(a->ncols == b->ncols);

	if (matd_is_scalar(a))
		return matd_create_scalar(a->data[0] - b->data[0]);

	matd_t *m = matd_create(a->nrows, a->ncols);

	for (int i = 0; i < m->nrows; i++) {
		for (int j = 0; j < m->ncols; j++) {
			MATD_EL(m, i, j)= MATD_EL(a, i, j) - MATD_EL(b, i, j);
		}
	}

	return m;
}

void matd_subtract_inplace(matd_t *a, const matd_t *b)
{
	assert(a != NULL);assert(b != NULL);assert(a->nrows == b->nrows);assert(a->ncols == b->ncols);

	if (matd_is_scalar(a)) {
		a->data[0] -= b->data[0];
		return;
	}

	for (int i = 0; i < a->nrows; i++) {
		for (int j = 0; j < a->ncols; j++) {
			MATD_EL(a, i, j)-= MATD_EL(b, i, j);
		}
	}
}

matd_t* matd_transpose(const matd_t *a)
{
	assert(a != NULL);

	if (matd_is_scalar(a))
		return matd_create_scalar(a->data[0]);

	matd_t *m = matd_create(a->ncols, a->nrows);

	for (int i = 0; i < a->nrows; i++) {
		for (int j = 0; j < a->ncols; j++) {
			MATD_EL(m, j, i)= MATD_EL(a, i, j);
		}
	}
	return m;
}

static
float matd_det_general(const matd_t *a)
{
	// Use LU decompositon to calculate the determinant
	matd_plu_t *mlu = matd_plu(a);
	matd_t *L = matd_plu_l(mlu);
	matd_t *U = matd_plu_u(mlu);

	// The determinants of the L and U matrices are the products of
	// their respective diagonal elements
	float detL = 1;
	float detU = 1;
	for (int i = 0; i < a->nrows; i++) {
		detL *= matd_get(L, i, i);
		detU *= matd_get(U, i, i);
	}

	// The determinant of a can be calculated as
	//     epsilon*det(L)*det(U),
	// where epsilon is just the sign of the corresponding permutation
	// (which is +1 for an even number of permutations and is −1
	// for an uneven number of permutations).
	float det = mlu->pivsign * detL * detU;

	// Cleanup
	matd_plu_destroy(mlu);
	matd_destroy(L);
	matd_destroy(U);

	return det;
}

float matd_det(const matd_t *a)
{
	assert(a != NULL);assert(a->nrows == a->ncols);

	switch (a->nrows) {
		case 0:
			// scalar: invalid
			assert(a->nrows > 0);
			break;

		case 1:
			// 1x1 matrix
			return a->data[0];

		case 2:
			// 2x2 matrix
			return a->data[0] * a->data[3] - a->data[1] * a->data[2];

		case 3:
			// 3x3 matrix
			return a->data[0] * a->data[4] * a->data[8] - a->data[0] * a->data[5] * a->data[7]
					+ a->data[1] * a->data[5] * a->data[6] - a->data[1] * a->data[3] * a->data[8]
					+ a->data[2] * a->data[3] * a->data[7] - a->data[2] * a->data[4] * a->data[6];

		case 4: {
			// 4x4 matrix
			float m00 = MATD_EL(a, 0, 0), m01 = MATD_EL(a, 0, 1), m02 = MATD_EL(a, 0, 2), m03 = MATD_EL(a, 0, 3);
			float m10 = MATD_EL(a, 1, 0), m11 = MATD_EL(a, 1, 1), m12 = MATD_EL(a, 1, 2), m13 = MATD_EL(a, 1, 3);
			float m20 = MATD_EL(a, 2, 0), m21 = MATD_EL(a, 2, 1), m22 = MATD_EL(a, 2, 2), m23 = MATD_EL(a, 2, 3);
			float m30 = MATD_EL(a, 3, 0), m31 = MATD_EL(a, 3, 1), m32 = MATD_EL(a, 3, 2), m33 = MATD_EL(a, 3, 3);

			return m00 * m11 * m22 * m33 - m00 * m11 * m23 * m32 - m00 * m21 * m12 * m33 + m00 * m21 * m13 * m32
					+ m00 * m31 * m12 * m23 - m00 * m31 * m13 * m22 - m10 * m01 * m22 * m33 + m10 * m01 * m23 * m32
					+ m10 * m21 * m02 * m33 - m10 * m21 * m03 * m32 - m10 * m31 * m02 * m23 + m10 * m31 * m03 * m22
					+ m20 * m01 * m12 * m33 - m20 * m01 * m13 * m32 - m20 * m11 * m02 * m33 + m20 * m11 * m03 * m32
					+ m20 * m31 * m02 * m13 - m20 * m31 * m03 * m12 - m30 * m01 * m12 * m23 + m30 * m01 * m13 * m22
					+ m30 * m11 * m02 * m23 - m30 * m11 * m03 * m22 - m30 * m21 * m02 * m13 + m30 * m21 * m03 * m12;
		}

		default:
			return matd_det_general(a);
	}

	assert(0);
	return 0;
}

// returns NULL if the matrix is (exactly) singular. Caller is
// otherwise responsible for knowing how to cope with badly
// conditioned matrices.
matd_t* matd_inverse(const matd_t *x)
{
	matd_t *m = NULL;

	assert(x != NULL);assert(x->nrows == x->ncols);

	if (matd_is_scalar(x)) {
		if (x->data[0] == 0)
			return NULL;

		return matd_create_scalar(1.0f / x->data[0]);	// STM32IPL: added f to the constant.
	}

	switch (x->nrows) {
		case 1: {
			float det = x->data[0];
			if (det == 0)
				return NULL;

			float invdet = 1.0f / det;	// STM32IPL: added f to the constant.

			m = matd_create(x->nrows, x->nrows);
			MATD_EL(m, 0, 0)= 1.0f * invdet;	// STM32IPL: added f to the constant.
			return m;
		}

		case 2: {
			float det = x->data[0] * x->data[3] - x->data[1] * x->data[2];
			if (det == 0)
				return NULL;

			float invdet = 1.0f / det;	// STM32IPL: added f to the constant.

			m = matd_create(x->nrows, x->nrows);
			MATD_EL(m, 0, 0)= MATD_EL(x, 1, 1) * invdet;
			MATD_EL(m, 0, 1)= - MATD_EL(x, 0, 1) * invdet;
			MATD_EL(m, 1, 0)= - MATD_EL(x, 1, 0) * invdet;
			MATD_EL(m, 1, 1)= MATD_EL(x, 0, 0) * invdet;
			return m;
		}

		default: {
			matd_plu_t *plu = matd_plu(x);

			matd_t *inv = NULL;
			if (!plu->singular) {
				matd_t *ident = matd_identity(x->nrows);
				inv = matd_plu_solve(plu, ident);
				matd_destroy(ident);
			}

			matd_plu_destroy(plu);

			return inv;
		}
	}

	// STM32IPL return NULL; // unreachable
}

// TODO Optimization: Some operations we could perform in-place,
// saving some memory allocation work. E.g., ADD, SUBTRACT. Just need
// to make sure that we don't do an in-place modification on a matrix
// that was an input argument!

// handle right-associative operators, greedily consuming them. These
// include transpose and inverse. This is called by the main recursion
// method.
static inline matd_t* matd_op_gobble_right(const char *expr, int *pos, matd_t *acc, matd_t **garb, int *garbpos)
{
	while (expr[*pos] != 0) {

		switch (expr[*pos]) {

			case '\'': {
				assert(acc != NULL); // either a syntax error or a math op failed, producing null
				matd_t *res = matd_transpose(acc);
				garb[*garbpos] = res;
				(*garbpos)++;
				acc = res;

				(*pos)++;
				break;
			}

				// handle inverse ^-1. No other exponents are allowed.
			case '^': {
				assert(acc != NULL);assert(expr[*pos+1] == '-');assert(expr[*pos+2] == '1');

