STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
				matd_t *res = matd_inverse(acc);
				garb[*garbpos] = res;
				(*garbpos)++;
				acc = res;

				(*pos) += 3;
				break;
			}

			default:
				return acc;
		}
	}

	return acc;
}

// @garb, garbpos  A list of every matrix allocated during evaluation... used to assist cleanup.
// @oneterm: we should return at the end of this term (i.e., stop at a PLUS, MINUS, LPAREN).
static matd_t* matd_op_recurse(const char *expr, int *pos, matd_t *acc, matd_t **args, int *argpos, matd_t **garb,
		int *garbpos, int oneterm)
{
	while (expr[*pos] != 0) {

		switch (expr[*pos]) {

			case '(': {
				if (oneterm && acc != NULL)
					return acc;
				(*pos)++;
				matd_t *rhs = matd_op_recurse(expr, pos, NULL, args, argpos, garb, garbpos, 0);
				rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

				if (acc == NULL) {
					acc = rhs;
				} else {
					matd_t *res = matd_multiply(acc, rhs);
					garb[*garbpos] = res;
					(*garbpos)++;
					acc = res;
				}

				break;
			}

			case ')': {
				if (oneterm)
					return acc;

				(*pos)++;
				return acc;
			}

			case '*': {
				(*pos)++;

				matd_t *rhs = matd_op_recurse(expr, pos, NULL, args, argpos, garb, garbpos, 1);
				rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

				if (acc == NULL) {
					acc = rhs;
				} else {
					matd_t *res = matd_multiply(acc, rhs);
					garb[*garbpos] = res;
					(*garbpos)++;
					acc = res;
				}

				break;
			}

			case 'F': {
				matd_t *rhs = args[*argpos];
				garb[*garbpos] = rhs;
				(*garbpos)++;

				(*pos)++;
				(*argpos)++;

				rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

				if (acc == NULL) {
					acc = rhs;
				} else {
					matd_t *res = matd_multiply(acc, rhs);
					garb[*garbpos] = res;
					(*garbpos)++;
					acc = res;
				}

				break;
			}

			case 'M': {
				matd_t *rhs = args[*argpos];

				(*pos)++;
				(*argpos)++;

				rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

				if (acc == NULL) {
					acc = rhs;
				} else {
					matd_t *res = matd_multiply(acc, rhs);
					garb[*garbpos] = res;
					(*garbpos)++;
					acc = res;
				}

				break;
			}

				/*
				 case 'D': {
				 int rows = expr[*pos+1]-'0';
				 int cols = expr[*pos+2]-'0';

				 matd_t *rhs = matd_create(rows, cols);

				 break;
				 }
				 */
				// a constant (SCALAR) defined inline. Treat just like M, creating a matd_t on the fly.
//            case '0':
//            case '1':
//            case '2':
//            case '3':
//            case '4':
//            case '5':
//            case '6':
//            case '7':
//            case '8':
//            case '9':
//            case '.': {
//                const char *start = &expr[*pos];
//                char *end;
//                float s = strtod(start, &end);
//                (*pos) += (end - start);
//                matd_t *rhs = matd_create_scalar(s);
//                garb[*garbpos] = rhs;
//                (*garbpos)++;
//                rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);
//                if (acc == NULL) {
//                    acc = rhs;
//                } else {
//                    matd_t *res = matd_multiply(acc, rhs);
//                    garb[*garbpos] = res;
//                    (*garbpos)++;
//                    acc = res;
//                }
//                break;
//            }
			case '+': {
				if (oneterm && acc != NULL)
					return acc;

				// don't support unary plus
				assert(acc != NULL);
				(*pos)++;
				matd_t *rhs = matd_op_recurse(expr, pos, NULL, args, argpos, garb, garbpos, 1);
				rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

				matd_t *res = matd_add(acc, rhs);

				garb[*garbpos] = res;
				(*garbpos)++;
				acc = res;
				break;
			}

			case '-': {
				if (oneterm && acc != NULL)
					return acc;

				if (acc == NULL) {
					// unary minus
					(*pos)++;
					matd_t *rhs = matd_op_recurse(expr, pos, NULL, args, argpos, garb, garbpos, 1);
					rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

					matd_t *res = matd_scale(rhs, -1);
					garb[*garbpos] = res;
					(*garbpos)++;
					acc = res;
				} else {
					// subtract
					(*pos)++;
					matd_t *rhs = matd_op_recurse(expr, pos, NULL, args, argpos, garb, garbpos, 1);
					rhs = matd_op_gobble_right(expr, pos, rhs, garb, garbpos);

					matd_t *res = matd_subtract(acc, rhs);
					garb[*garbpos] = res;
					(*garbpos)++;
					acc = res;
				}
				break;
			}

			case ' ': {
				// nothing to do. spaces are meaningless.
				(*pos)++;
				break;
			}

			default: {
				fprintf(stderr, "matd_op(): Unknown character: '%c'\n", expr[*pos]);assert(expr[*pos] != expr[*pos]);
			}
		}
	}
	return acc;
}

// STM32IPL: function modified to solve VLA problems.
// always returns a new matrix.
matd_t* matd_op(const char *expr, ...)
{
	int nargs = 0;
	int exprlen = 0;

	assert(expr != NULL);

	for (const char *p = expr; *p != 0; p++) {
		if (*p == 'M' || *p == 'F')
			nargs++;
		exprlen++;
	}

	assert(nargs > 0);

	if (!exprlen) // expr = ""
		return NULL;

	va_list ap;
	va_start(ap, expr);

//	matd_t *args[nargs];
	matd_t **args = xalloc(nargs * sizeof(matd_t*));
	if (!args)
		return NULL;

	for (int i = 0; i < nargs; i++) {
		args[i] = va_arg(ap, matd_t*);
		// XXX: sanity check argument; emit warning/error if args[i]
		// doesn't look like a matd_t*.
	}

	va_end(ap);

	int pos = 0;
	int argpos = 0;
	int garbpos = 0;

//	matd_t *garb[2 * exprlen]; // can't create more than 2 new result per character
							   // one result, and possibly one argument to free
	matd_t **garb = xalloc(2 * exprlen * sizeof(matd_t*));
	if (!garb) {
		xfree(args);
		return NULL;
	}

	matd_t *res = matd_op_recurse(expr, &pos, NULL, args, &argpos, garb, &garbpos, 0);

// 'res' may need to be freed as part of garbage collection (i.e. expr = "F")
	matd_t *res_copy = (res ? matd_copy(res) : NULL);

	for (int i = 0; i < garbpos; i++) {
		matd_destroy(garb[i]);
	}

	xfree(args);
	xfree(garb);

	return res_copy;
}

float matd_vec_mag(const matd_t *a)
{
	assert(a != NULL);assert(matd_is_vector(a));

	float mag = 0.0;
	int len = a->nrows * a->ncols;
	for (int i = 0; i < len; i++)
		mag += sq(a->data[i]);
	return sqrt(mag);
}

float matd_vec_dist(const matd_t *a, const matd_t *b)
{
	assert(a != NULL);assert(b != NULL);assert(matd_is_vector(a) && matd_is_vector(b));assert(a->nrows*a->ncols == b->nrows*b->ncols);

	int lena = a->nrows * a->ncols;
	return matd_vec_dist_n(a, b, lena);
}

float matd_vec_dist_n(const matd_t *a, const matd_t *b, int n)
{
	/* STM32IPL: useless.
	 assert(a != NULL); assert(b != NULL); assert(matd_is_vector(a) && matd_is_vector(b));

	 int lena = a->nrows * a->ncols;
	 int lenb = b->nrows * b->ncols;

	 assert(n <= lena && n <= lenb);
	 STM32IPL */

	float mag = 0.0;
	for (int i = 0; i < n; i++)
		mag += sq(a->data[i] - b->data[i]);
	return sqrt(mag);
}

