STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
// find the index of the off-diagonal element with the largest mag
static inline int max_idx(const matd_t *A, int row, int maxcol)
{
	int maxi = 0;
	float maxv = -1;

	for (int i = 0; i < maxcol; i++) {
		if (i == row)
			continue;
		float v = fabs(MATD_EL(A, row, i));
		if (v > maxv) {
			maxi = i;
			maxv = v;
		}
	}

	return maxi;
}

float matd_vec_dot_product(const matd_t *a, const matd_t *b)
{
// STM32IPL: useless. assert(a != NULL);
// STM32IPL: useless. assert(b != NULL);
// STM32IPL: useless. assert(matd_is_vector(a) && matd_is_vector(b));

	int adim = a->ncols * a->nrows;
// STM32IPL: useless. int bdim = b->ncols * b->nrows;
// STM32IPL: useless. assert(adim == bdim);

	float acc = 0;
	for (int i = 0; i < adim; i++) {
		acc += a->data[i] * b->data[i];
	}
	return acc;
}

matd_t* matd_vec_normalize(const matd_t *a)
{
	assert(a != NULL);assert(matd_is_vector(a));

	float mag = matd_vec_mag(a);
	assert(mag > 0);

	matd_t *b = matd_create(a->nrows, a->ncols);

	int len = a->nrows * a->ncols;
	for (int i = 0; i < len; i++)
		b->data[i] = a->data[i] / mag;

	return b;
}

matd_t* matd_crossproduct(const matd_t *a, const matd_t *b)
{ // only defined for vecs (col or row) of length 3
	assert(a != NULL);assert(b != NULL);assert(matd_is_vector_len(a, 3) && matd_is_vector_len(b, 3));

	matd_t *r = matd_create(a->nrows, a->ncols);

	r->data[0] = a->data[1] * b->data[2] - a->data[2] * b->data[1];
	r->data[1] = a->data[2] * b->data[0] - a->data[0] * b->data[2];
	r->data[2] = a->data[0] * b->data[1] - a->data[1] * b->data[0];

	return r;
}

TYPE matd_err_inf(const matd_t *a, const matd_t *b)
{
	assert(a->nrows == b->nrows);assert(a->ncols == b->ncols);

	TYPE maxf = 0;

	for (int i = 0; i < a->nrows; i++) {
		for (int j = 0; j < a->ncols; j++) {
			TYPE av = MATD_EL(a, i, j);
			TYPE bv = MATD_EL(b, i, j);

			TYPE err = fabs(av - bv);
			maxf = fmax(maxf, err);
		}
	}

	return maxf;
}

// STM32IPL: function modified to solve VLA problems.

// Computes an SVD for square or tall matrices. This code doesn't work
// for wide matrices, because the bidiagonalization results in one
// non-zero element too far to the right for us to rotate away.
//
// Caller is responsible for destroying U, S, and V.
static matd_svd_t matd_svd_tall(matd_t *A, int flags)
{
	matd_t *B = matd_copy(A);

// Apply householder reflections on each side to reduce A to
// bidiagonal form. Specifically:
//
// A = LS*B*RS'
//
// Where B is bidiagonal, and LS/RS are unitary.
//
// Why are we doing this? Some sort of transformation is necessary
// to reduce the matrix's nz elements to a square region. QR could
// work too. We need nzs confined to a square region so that the
// subsequent iterative process, which is based on rotations, can
// work. (To zero out a term at (i,j), our rotations will also
// affect (j,i).
//
// We prefer bidiagonalization over QR because it gets us "closer"
// to the SVD, which should mean fewer iterations.

// LS: cumulative left-handed transformations
	matd_t *LS = matd_identity(A->nrows);

// RS: cumulative right-handed transformations.
	matd_t *RS = matd_identity(A->ncols);

	for (int hhidx = 0; hhidx < A->nrows; hhidx++) {

		if (hhidx < A->ncols) {
			// We construct the normal of the reflection plane: let u
			// be the vector to reflect, x =[ M 0 0 0 ] the target
			// location for u (u') after reflection (with M = ||u||).
			//
			// The normal vector is then n = (u - x), but since we
			// could equally have the target location be x = [-M 0 0 0
			// ], we could use n = (u + x).
			//
			// We then normalize n. To ensure a reasonable magnitude,
			// we select the sign of M so as to maximize the magnitude
			// of the first element of (x +/- M). (Otherwise, we could
			// end up with a divide-by-zero if u[0] and M cancel.)
			//
			// The householder reflection matrix is then H=(I - nn'), and
			// u' = Hu.
			//
			//
			int vlen = A->nrows - hhidx;

			//float v[vlen];
			float *v = xalloc(vlen * sizeof(float));
			if (!v) {
				matd_svd_t res;
				memset(&res, 0, sizeof(res));
				return res;
			}

			float mag2 = 0;
			for (int i = 0; i < vlen; i++) {
				v[i] = MATD_EL(B, hhidx + i, hhidx);
				mag2 += v[i] * v[i];
			}

			float oldv0 = v[0];
			if (oldv0 < 0)
				v[0] -= sqrt(mag2);
			else
				v[0] += sqrt(mag2);

			mag2 += -oldv0 * oldv0 + v[0] * v[0];

			// normalize v
			float mag = sqrt(mag2);

			// this case arises with matrices of all zeros, for example.
			if (mag == 0)
				continue;

			for (int i = 0; i < vlen; i++)
				v[i] /= mag;

			// Q = I - 2vv'
			//matd_t *Q = matd_identity(A->nrows);
			//for (int i = 0; i < vlen; i++)
			//  for (int j = 0; j < vlen; j++)
			//    MATD_EL(Q, i+hhidx, j+hhidx) -= 2*v[i]*v[j];

			// LS = matd_op("F*M", LS, Q);
			// Implementation: take each row of LS, compute dot product with n,
			// subtract n (scaled by dot product) from it.
			for (int i = 0; i < LS->nrows; i++) {
				float dot = 0;
				for (int j = 0; j < vlen; j++)
					dot += MATD_EL(LS, i, hhidx+j)* v[j];
				for (int j = 0; j < vlen; j++)
					MATD_EL(LS, i, hhidx+j)-= 2*dot*v[j];
				}

				//  B = matd_op("M*F", Q, B); // should be Q', but Q is symmetric.
			for (int i = 0; i < B->ncols; i++) {
				float dot = 0;
				for (int j = 0; j < vlen; j++)
					dot += MATD_EL(B, hhidx+j, i)* v[j];
				for (int j = 0; j < vlen; j++)
					MATD_EL(B, hhidx+j, i)-= 2*dot*v[j];
				}

			xfree(v);
			}

			if (hhidx+2 < A->ncols) {
				int vlen = A->ncols - hhidx - 1;

				//float v[vlen];
				float *v = xalloc(vlen * sizeof(float));
				if (!v) {
					matd_svd_t res;
					memset(&res, 0, sizeof(res));
					return res;
				}

				float mag2 = 0;
				for (int i = 0; i < vlen; i++) {
					v[i] = MATD_EL(B, hhidx, hhidx+i+1);
					mag2 += v[i]*v[i];
				}

				float oldv0 = v[0];
				if (oldv0 < 0)
				v[0] -= sqrt(mag2);
				else
				v[0] += sqrt(mag2);

				mag2 += -oldv0*oldv0 + v[0]*v[0];

				// compute magnitude of ([1 0 0..]+v)
				float mag = sqrt(mag2);

				// this case can occur when the vectors are already perpendicular
				if (mag == 0)
				continue;

				for (int i = 0; i < vlen; i++)
				v[i] /= mag;

				// TODO: optimize these multiplications
				// matd_t *Q = matd_identity(A->ncols);
				//  for (int i = 0; i < vlen; i++)
				//    for (int j = 0; j < vlen; j++)
				//       MATD_EL(Q, i+1+hhidx, j+1+hhidx) -= 2*v[i]*v[j];

				//  RS = matd_op("F*M", RS, Q);
				for (int i = 0; i < RS->nrows; i++) {
					float dot = 0;
					for (int j = 0; j < vlen; j++)
					dot += MATD_EL(RS, i, hhidx+1+j) * v[j];
					for (int j = 0; j < vlen; j++)
					MATD_EL(RS, i, hhidx+1+j) -= 2*dot*v[j];
				}

				//   B = matd_op("F*M", B, Q); // should be Q', but Q is symmetric.
				for (int i = 0; i < B->nrows; i++) {
					float dot = 0;
					for (int j = 0; j < vlen; j++)
					dot += MATD_EL(B, i, hhidx+1+j) * v[j];
					for (int j = 0; j < vlen; j++)
					MATD_EL(B, i, hhidx+1+j) -= 2*dot*v[j];
				}
				xfree(v);
			}
		}

