STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
		// maxiters used to be smaller to prevent us from looping forever,
		// but this doesn't seem to happen any more with our more stable
		// svd22 implementation.
	int maxiters = 1UL << 5; // 1UL << 30;
	assert(maxiters > 0); // reassure clang
	int iter;

	float maxv; // maximum non-zero value being reduced this iteration

	float tol = 1E-5; // 1E-10;

// which method will we use to find the largest off-diagonal
// element of B?
	const int find_max_method = 1; //(B->ncols < 6) ? 2 : 1;

// for each of the first B->ncols rows, which index has the
// maximum absolute value? (used by method 1)
	//int maxrowidx[B->ncols];
	int *maxrowidx = xalloc(B->ncols * sizeof(int));
	if (!maxrowidx) {
		matd_svd_t res;
		memset(&res, 0, sizeof(res));
		return res;
	}

	int lastmaxi, lastmaxj;

	if (find_max_method == 1) {
		for (int i = 2; i < B->ncols; i++)
			maxrowidx[i] = max_idx(B, i, B->ncols);

		// note that we started the array at 2. That's because by setting
		// these values below, we'll recompute first two entries on the
		// first iteration!
		lastmaxi = 0, lastmaxj = 1;
	}

	for (iter = 0; iter < maxiters; iter++) {

		// No diagonalization required for 0x0 and 1x1 matrices.
		if (B->ncols < 2)
			break;

		// find the largest off-diagonal element of B, and put its
		// coordinates in maxi, maxj.
		int maxi, maxj;

		if (find_max_method == 1) {
			// method 1 is the "smarter" method which does at least
			// 4*ncols work. More work might be needed (up to
			// ncols*ncols), depending on data. Thus, this might be a
			// bit slower than the default method for very small
			// matrices.
			maxi = -1;
			maxv = -1;

			// every iteration, we must deal with the fact that rows
			// and columns lastmaxi and lastmaxj have been
			// modified. Update maxrowidx accordingly.

			// now, EVERY row also had columns lastmaxi and lastmaxj modified.
			for (int rowi = 0; rowi < B->ncols; rowi++) {

				// the magnitude of the largest off-diagonal element
				// in this row.
				float thismaxv;

				// row 'lastmaxi' and 'lastmaxj' have been completely
				// changed. compute from scratch.
				if (rowi == lastmaxi || rowi == lastmaxj) {
					maxrowidx[rowi] = max_idx(B, rowi, B->ncols);
					thismaxv = fabs(MATD_EL(B, rowi, maxrowidx[rowi]));
					goto endrowi;
				}

				// our maximum entry was just modified. We don't know
				// if it went up or down, and so we don't know if it
				// is still the maximum. We have to update from
				// scratch.
				if (maxrowidx[rowi] == lastmaxi || maxrowidx[rowi] == lastmaxj) {
					maxrowidx[rowi] = max_idx(B, rowi, B->ncols);
					thismaxv = fabs(MATD_EL(B, rowi, maxrowidx[rowi]));
					goto endrowi;
				}

				// This row is unchanged, except for columns
				// 'lastmaxi' and 'lastmaxj', and those columns were
				// not previously the largest entry...  just check to
				// see if they are now the maximum entry in their
				// row. (Remembering to consider off-diagonal entries
				// only!)
				thismaxv = fabs(MATD_EL(B, rowi, maxrowidx[rowi]));

				// check column lastmaxi. Is it now the maximum?
				if (lastmaxi != rowi) {
					float v = fabs(MATD_EL(B, rowi, lastmaxi));
					if (v > thismaxv) {
						thismaxv = v;
						maxrowidx[rowi] = lastmaxi;
					}
				}

				// check column lastmaxj
				if (lastmaxj != rowi) {
					float v = fabs(MATD_EL(B, rowi, lastmaxj));
					if (v > thismaxv) {
						thismaxv = v;
						maxrowidx[rowi] = lastmaxj;
					}
				}

				// does this row have the largest value we've seen so far?
				endrowi:
				if (thismaxv > maxv) {
					maxv = thismaxv;
					maxi = rowi;
				}
			}

			assert(maxi >= 0);
			maxj = maxrowidx[maxi];

			// save these for the next iteration.
			lastmaxi = maxi;
			lastmaxj = maxj;

			if (maxv < tol)
				break;

		} else
			if (find_max_method == 2) {
				// brute-force (reference) version.
				maxv = -1;

				// only search top "square" portion
				for (int i = 0; i < B->ncols; i++) {
					for (int j = 0; j < B->ncols; j++) {
						if (i == j)
							continue;

						float v = fabs(MATD_EL(B, i, j));

						if (v > maxv) {
							maxi = i;
							maxj = j;
							maxv = v;
						}
					}
				}

				// termination condition.
				if (maxv < tol)
					break;
			} else {
				assert(0);
			}

//        printf(">>> %5d %3d, %3d %15g\n", maxi, maxj, iter, maxv);

		// Now, solve the 2x2 SVD problem for the matrix
		// [ A0 A1 ]
		// [ A2 A3 ]
		float A0 = MATD_EL(B, maxi, maxi);
		float A1 = MATD_EL(B, maxi, maxj);
		float A2 = MATD_EL(B, maxj, maxi);
		float A3 = MATD_EL(B, maxj, maxj);

		if (1) {
			float AQ[4];
			AQ[0] = A0;
			AQ[1] = A1;
			AQ[2] = A2;
			AQ[3] = A3;

			float U[4], S[2], V[4];
			svd22(AQ, U, S, V);

			/*  Reference (slow) implementation...

			 // LS = LS * ROT(theta) = LS * QL
			 matd_t *QL = matd_identity(A->nrows);
			 MATD_EL(QL, maxi, maxi) = U[0];
			 MATD_EL(QL, maxi, maxj) = U[1];
			 MATD_EL(QL, maxj, maxi) = U[2];
			 MATD_EL(QL, maxj, maxj) = U[3];

			 matd_t *QR = matd_identity(A->ncols);
			 MATD_EL(QR, maxi, maxi) = V[0];
			 MATD_EL(QR, maxi, maxj) = V[1];
			 MATD_EL(QR, maxj, maxi) = V[2];
			 MATD_EL(QR, maxj, maxj) = V[3];

			 LS = matd_op("F*M", LS, QL);
			 RS = matd_op("F*M", RS, QR); // remember we'll transpose RS.
			 B = matd_op("M'*F*M", QL, B, QR);

			 matd_destroy(QL);
			 matd_destroy(QR);
			 */

			//  LS = matd_op("F*M", LS, QL);
			for (int i = 0; i < LS->nrows; i++) {
				float vi = MATD_EL(LS, i, maxi);
				float vj = MATD_EL(LS, i, maxj);

				MATD_EL(LS, i, maxi)= U[0]*vi + U[2]*vj;
				MATD_EL(LS, i, maxj)= U[1]*vi + U[3]*vj;
			}

			//  RS = matd_op("F*M", RS, QR); // remember we'll transpose RS.
			for (int i = 0; i < RS->nrows; i++) {
				float vi = MATD_EL(RS, i, maxi);
				float vj = MATD_EL(RS, i, maxj);

				MATD_EL(RS, i, maxi)= V[0]*vi + V[2]*vj;
				MATD_EL(RS, i, maxj)= V[1]*vi + V[3]*vj;
			}

			// B = matd_op("M'*F*M", QL, B, QR);
			// The QL matrix mixes rows of B.
			for (int i = 0; i < B->ncols; i++) {
				float vi = MATD_EL(B, maxi, i);
				float vj = MATD_EL(B, maxj, i);

				MATD_EL(B, maxi, i)= U[0]*vi + U[2]*vj;
				MATD_EL(B, maxj, i)= U[1]*vi + U[3]*vj;
			}

			// The QR matrix mixes columns of B.
			for (int i = 0; i < B->nrows; i++) {
				float vi = MATD_EL(B, i, maxi);
				float vj = MATD_EL(B, i, maxj);

