STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
				MATD_EL(B, i, maxi)= V[0]*vi + V[2]*vj;
				MATD_EL(B, i, maxj)= V[1]*vi + V[3]*vj;
			}
		}
	}

	xfree(maxrowidx);
	maxrowidx = NULL;

#ifndef STM32IPL
	if (!(flags & MATD_SVD_NO_WARNINGS) && iter == maxiters) {
		printf("WARNING: maximum iters (maximum = %d, matrix %d x %d, max=%.15f)\n", iter, A->nrows, A->ncols,
				(double)maxv);

//        matd_print(A, "%15f");
	}
#endif /* STM32IPL */

// them all positive by flipping the corresponding columns of
// U/LS.
	//int idxs[A->ncols];
	int *idxs = xalloc(A->ncols * sizeof(int));
	if (!idxs){
		matd_svd_t res;
		memset(&res, 0, sizeof(res));
		return res;
	}

	//float vals[A->ncols];
	float *vals = xalloc(A->ncols * sizeof(float));
	if (!vals){
		matd_svd_t res;
		memset(&res, 0, sizeof(res));
		return res;
	}

	for (int i = 0; i < A->ncols; i++) {
		idxs[i] = i;
		vals[i] = MATD_EL(B, i, i);
	}

// A bubble sort. Seriously.
	int changed;
	do {
		changed = 0;

		for (int i = 0; i + 1 < A->ncols; i++) {
			if (fabs(vals[i+1]) > fabs(vals[i])) {
				int tmpi = idxs[i];
				idxs[i] = idxs[i + 1];
				idxs[i + 1] = tmpi;

				float tmpv = vals[i];
				vals[i] = vals[i + 1];
				vals[i + 1] = tmpv;

				changed = 1;
			}
		}
	} while (changed);

	matd_t *LP = matd_identity(A->nrows);
	matd_t *RP = matd_identity(A->ncols);

	for (int i = 0; i < A->ncols; i++) {
		MATD_EL(LP, idxs[i], idxs[i])= 0; // undo the identity above
		MATD_EL(RP, idxs[i], idxs[i]) = 0;

		MATD_EL(LP, idxs[i], i) = vals[i] < 0 ? -1 : 1;
		MATD_EL(RP, idxs[i], i) = 1;//vals[i] < 0 ? -1 : 1;
	}

// we've factored:
// LP*(something)*RP'

// solve for (something)
	B = matd_op("M'*F*M", LP, B, RP);

// update LS and RS, remembering that RS will be transposed.
	LS = matd_op("F*M", LS, LP);
	RS = matd_op("F*M", RS, RP);

	matd_destroy(LP);
	matd_destroy(RP);

	matd_svd_t res;
	memset(&res, 0, sizeof(res));

// make B exactly diagonal

	for (int i = 0; i < B->nrows; i++) {
		for (int j = 0; j < B->ncols; j++) {
			if (i != j)
				MATD_EL(B, i, j)= 0;
			}
		}

	res.U = LS;
	res.S = B;
	res.V = RS;

	xfree(idxs);
	xfree(vals);

	return res;
}

matd_svd_t matd_svd(matd_t *A)
{
	return matd_svd_flags(A, 0);
}

matd_svd_t matd_svd_flags(matd_t *A, int flags)
{
	matd_svd_t res;

	if (A->ncols <= A->nrows) {
		res = matd_svd_tall(A, flags);
	} else {
		matd_t *At = matd_transpose(A);

		// A =U  S  V'
		// A'=V  S' U'

		matd_svd_t tmp = matd_svd_tall(At, flags);

		memset(&res, 0, sizeof(res));
		res.U = tmp.V; //matd_transpose(tmp.V);
		res.S = matd_transpose(tmp.S);
		res.V = tmp.U; //matd_transpose(tmp.U);

		matd_destroy(tmp.S);
		matd_destroy(At);
	}

	/*
	 matd_t *check = matd_op("M*M*M'-M", res.U, res.S, res.V, A);
	 float maxerr = 0;

	 for (int i = 0; i < check->nrows; i++)
	 for (int j = 0; j < check->ncols; j++)
	 maxerr = fmax(maxerr, fabs(MATD_EL(check, i, j)));

	 matd_destroy(check);

	 if (maxerr > 1e-7) {
	 printf("bad maxerr: %15f\n", maxerr);
	 }

	 if (maxerr > 1e-5) {
	 printf("bad maxerr: %15f\n", maxerr);
	 matd_print(A, "%15f");
	 assert(0);
	 }

	 */
	return res;
}

// STM32IPL: function modified to solve VLA problems.
matd_plu_t* matd_plu(const matd_t *a)
{
	unsigned int *piv = calloc(a->nrows, sizeof(unsigned int));
	int pivsign = 1;
	matd_t *lu = matd_copy(a);

// only for square matrices.
	assert(a->nrows == a->ncols);

	matd_plu_t *mlu = calloc(1, sizeof(matd_plu_t));

	for (int i = 0; i < a->nrows; i++)
		piv[i] = i;

	for (int j = 0; j < a->ncols; j++) {
		for (int i = 0; i < a->nrows; i++) {
			int kmax = i < j ? i : j; // min(i,j)

			// compute dot product of row i with column j (up through element kmax)
			float acc = 0;
			for (int k = 0; k < kmax; k++)
				acc += MATD_EL(lu, i, k)* MATD_EL(lu, k, j);

			MATD_EL(lu, i, j)-= acc;
		}

		// find pivot and exchange if necessary.
		int p = j;
		if (1) {
			for (int i = j+1; i < lu->nrows; i++) {
				if (fabs(MATD_EL(lu,i,j)) > fabs(MATD_EL(lu, p, j))) {
					p = i;
				}
			}
		}

		// swap rows p and j?
		if (p != j) {
			//TYPE tmp[lu->ncols];
			TYPE *tmp = xalloc(lu->ncols * sizeof(TYPE));
			// STM32IPL: as calloc calls above are not checked against memory leakage,
			// this xalloc is not checked as well :-(

			memcpy(tmp, &MATD_EL(lu, p, 0), sizeof(TYPE) * lu->ncols);
			memcpy(&MATD_EL(lu, p, 0), &MATD_EL(lu, j, 0), sizeof(TYPE) * lu->ncols);
			memcpy(&MATD_EL(lu, j, 0), tmp, sizeof(TYPE) * lu->ncols);
			int k = piv[p];
			piv[p] = piv[j];
			piv[j] = k;
			pivsign = -pivsign;

			xfree(tmp);
		}

		float LUjj = MATD_EL(lu, j, j);

		// If our pivot is very small (which means the matrix is
		// singular or nearly singular), replace with a new pivot of the
		// right sign.
		if (fabs(LUjj) < MATD_EPS) {
			/*
			 if (LUjj < 0)
			 LUjj = -MATD_EPS;
			 else
			 LUjj = MATD_EPS;

			 MATD_EL(lu, j, j) = LUjj;
			 */
			mlu->singular = 1;
		}

		if (j < lu->ncols && j < lu->nrows && LUjj != 0) {
			LUjj = 1.0f / LUjj;	// STM32IPL: added f to the constant.
			for (int i = j+1; i < lu->nrows; i++)
			MATD_EL(lu, i, j) *= LUjj;
		}
	}

	mlu->lu = lu;
	mlu->piv = piv;
	mlu->pivsign = pivsign;

	return mlu;
}

void matd_plu_destroy(matd_plu_t *mlu)
{
	matd_destroy(mlu->lu);
	free(mlu->piv);
	memset(mlu, 0, sizeof(matd_plu_t));
	free(mlu);
}

float matd_plu_det(const matd_plu_t *mlu)
{
	matd_t *lu = mlu->lu;
	float det = mlu->pivsign;

	if (lu->nrows == lu->ncols) {
		for (int i = 0; i < lu->ncols; i++)
			det *= MATD_EL(lu, i, i);
	}

	return det;
}

matd_t* matd_plu_p(const matd_plu_t *mlu)
{
	matd_t *lu = mlu->lu;
	matd_t *P = matd_create(lu->nrows, lu->nrows);

	for (int i = 0; i < lu->nrows; i++) {
		MATD_EL(P, mlu->piv[i], i)= 1;
	}

	return P;
}

matd_t* matd_plu_l(const matd_plu_t *mlu)
{
	matd_t *lu = mlu->lu;

	matd_t *L = matd_create(lu->nrows, lu->ncols);
	for (int i = 0; i < lu->nrows; i++) {
		MATD_EL(L, i, i)= 1;

		for (int j = 0; j < i; j++) {
			MATD_EL(L, i, j) = MATD_EL(lu, i, j);
		}
	}

	return L;
}

matd_t* matd_plu_u(const matd_plu_t *mlu)
{
	matd_t *lu = mlu->lu;

	matd_t *U = matd_create(lu->ncols, lu->ncols);
	for (int i = 0; i < lu->ncols; i++) {
		for (int j = 0; j < lu->ncols; j++) {
			if (i <= j)
				MATD_EL(U, i, j)= MATD_EL(lu, i, j);
			}
		}

	return U;
}

// PLU = A
// Ax = B
// PLUx = B
// LUx = P'B
matd_t* matd_plu_solve(const matd_plu_t *mlu, const matd_t *b)
{
	matd_t *x = matd_copy(b);

