STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
	// permute right hand side
	for (int i = 0; i < mlu->lu->nrows; i++)
		memcpy(&MATD_EL(x, i, 0), &MATD_EL(b, mlu->piv[i], 0), sizeof(TYPE) * b->ncols);

	// solve Ly = b
	for (int k = 0; k < mlu->lu->nrows; k++) {
		for (int i = k + 1; i < mlu->lu->nrows; i++) {
			float LUik = -MATD_EL(mlu->lu, i, k);
			for (int t = 0; t < b->ncols; t++)
				MATD_EL(x, i, t)+= MATD_EL(x, k, t) * LUik;
			}
		}

		// solve Ux = y
	for (int k = mlu->lu->ncols - 1; k >= 0; k--) {
		float LUkk = 1.0f / MATD_EL(mlu->lu, k, k);	// STM32IPL: added f to the constant.
		for (int t = 0; t < b->ncols; t++)
			MATD_EL(x, k, t)*= LUkk;

		for (int i = 0; i < k; i++) {
			float LUik = -MATD_EL(mlu->lu, i, k);
			for (int t = 0; t < b->ncols; t++)
				MATD_EL(x, i, t)+= MATD_EL(x, k, t) *LUik;
			}
		}

	return x;
}

matd_t* matd_solve(matd_t *A, matd_t *b)
{
	matd_plu_t *mlu = matd_plu(A);
	matd_t *x = matd_plu_solve(mlu, b);

	matd_plu_destroy(mlu);
	return x;
}

#if 0

static int randi()
{
    int v = random()&31;
    v -= 15;
    return v;
}

static float randf()
{
    float v = 1.0 *random() / RAND_MAX;
    return 2*v - 1;
}

int main(int argc, char *argv[])
{
    if (1) {
        int maxdim = 16;
        matd_t *A = matd_create(maxdim, maxdim);

        for (int iter = 0; 1; iter++) {
            srand(iter);

            if (iter % 1000 == 0)
                printf("%d\n", iter);

            int m = 1 + (random()%(maxdim-1));
            int n = 1 + (random()%(maxdim-1));

            for (int i = 0; i < m*n; i++)
                A->data[i] = randi();

            A->nrows = m;
            A->ncols = n;

//            printf("%d %d ", m, n);
            matd_svd_t svd = matd_svd(A);
            matd_destroy(svd.U);
            matd_destroy(svd.S);
            matd_destroy(svd.V);

        }

/*        matd_t *A = matd_create_data(2, 5, (float[]) { 1, 5, 2, 6,
          3, 3, 0, 7,
          1, 1, 0, -2,
          4, 0, 9, 9, 2, 6, 1, 3, 2, 5, 5, 4, -1, 2, 5, 9, 8, 2 });

          matd_svd(A);
*/
        return 0;
    }


    struct svd22 s;

    srand(0);

    matd_t *A = matd_create(2, 2);
    MATD_EL(A,0,0) = 4;
    MATD_EL(A,0,1) = 7;
    MATD_EL(A,1,0) = 2;
    MATD_EL(A,1,1) = 6;

    matd_t *U = matd_create(2, 2);
    matd_t *V = matd_create(2, 2);
    matd_t *S = matd_create(2, 2);

    for (int iter = 0; 1; iter++) {
        if (iter % 100000 == 0)
            printf("%d\n", iter);

        MATD_EL(A,0,0) = randf();
        MATD_EL(A,0,1) = randf();
        MATD_EL(A,1,0) = randf();
        MATD_EL(A,1,1) = randf();

        matd_svd22_impl(A->data, &s);

        memcpy(U->data, s.U, 4*sizeof(float));
        memcpy(V->data, s.V, 4*sizeof(float));
        MATD_EL(S,0,0) = s.S[0];
        MATD_EL(S,1,1) = s.S[1];

        assert(s.S[0] >= s.S[1]);
        assert(s.S[0] >= 0);
        assert(s.S[1] >= 0);
        if (s.S[0] == 0) {
//            printf("*"); fflush(NULL);
//            printf("%15f %15f %15f %15f\n", MATD_EL(A,0,0), MATD_EL(A,0,1), MATD_EL(A,1,0), MATD_EL(A,1,1));
        }
        if (s.S[1] == 0) {
//            printf("#"); fflush(NULL);
        }

        matd_t *USV = matd_op("M*M*M'", U, S, V);

        float maxerr = 0;
        for (int i = 0; i < 4; i++)
            maxerr = fmax(maxerr, fabs(USV->data[i] - A->data[i]));

        if (0) {
            printf("------------------------------------\n");
            printf("A:\n");
            matd_print(A, "%15f");
            printf("\nUSV':\n");
            matd_print(USV, "%15f");
            printf("maxerr: %.15f\n", maxerr);
            printf("\n\n");
        }

        matd_destroy(USV);

        assert(maxerr < 0.00001);
    }
}

#endif

// XXX NGV Cholesky
/*static float *matd_cholesky_raw(float *A, int n)
 {
 float *L = (float*)calloc(n * n, sizeof(float));

 for (int i = 0; i < n; i++) {
 for (int j = 0; j < (i+1); j++) {
 float s = 0;
 for (int k = 0; k < j; k++)
 s += L[i * n + k] * L[j * n + k];
 L[i * n + j] = (i == j) ?
 sqrt(A[i * n + i] - s) :
 (1.0 / L[j * n + j] * (A[i * n + j] - s));
 }
 }

 return L;
 }

 matd_t *matd_cholesky(const matd_t *A)
 {
 assert(A->nrows == A->ncols);
 float *L_data = matd_cholesky_raw(A->data, A->nrows);
 matd_t *L = matd_create_data(A->nrows, A->ncols, L_data);
 free(L_data);
 return L;
 }*/

// NOTE: The below implementation of Cholesky is different from the one
// used in NGV.
matd_chol_t* matd_chol(matd_t *A)
{
	assert(A->nrows == A->ncols);
	int N = A->nrows;

	// make upper right
	matd_t *U = matd_copy(A);

	// don't actually need to clear lower-left... we won't touch it.
	/*    for (int i = 0; i < U->nrows; i++) {
	 for (int j = 0; j < i; j++) {
	 //            assert(MATD_EL(U, i, j) == MATD_EL(U, j, i));
	 MATD_EL(U, i, j) = 0;
	 }
	 }
	 */
	int is_spd = 1; // (A->nrows == A->ncols);

	for (int i = 0; i < N; i++) {
		float d = MATD_EL(U, i, i);
		is_spd &= (d > 0);

		if (d < MATD_EPS)
			d = MATD_EPS;
		d = 1.0f / sqrt(d);	// STM32IPL: added f to the constant.

		for (int j = i; j < N; j++)
			MATD_EL(U, i, j)*= d;

		for (int j = i + 1; j < N; j++) {
			float s = MATD_EL(U, i, j);

			if (s == 0)
				continue;

			for (int k = j; k < N; k++) {
				MATD_EL(U, j, k)-= MATD_EL(U, i, k)*s;
			}
		}
	}

	matd_chol_t *chol = calloc(1, sizeof(matd_chol_t));
	chol->is_spd = is_spd;
	chol->u = U;
	return chol;
}

void matd_chol_destroy(matd_chol_t *chol)
{
	matd_destroy(chol->u);
	free(chol);
}

// Solve: (U')x = b, U is upper triangular
void matd_ltransposetriangle_solve(matd_t *u, const TYPE *b, TYPE *x)
{
	int n = u->ncols;
	memcpy(x, b, n * sizeof(TYPE));
	for (int i = 0; i < n; i++) {
		x[i] /= MATD_EL(u, i, i);

		for (int j = i + 1; j < u->ncols; j++) {
			x[j] -= x[i] * MATD_EL(u, i, j);
		}
	}
}

// Solve: Lx = b, L is lower triangular
void matd_ltriangle_solve(matd_t *L, const TYPE *b, TYPE *x)
{
	int n = L->ncols;

	for (int i = 0; i < n; i++) {
		float acc = b[i];

		for (int j = 0; j < i; j++) {
			acc -= MATD_EL(L, i, j)*x[j];
		}

		x[i] = acc / MATD_EL(L, i, i);
	}
}

// solve Ux = b, U is upper triangular
void matd_utriangle_solve(matd_t *u, const TYPE *b, TYPE *x)
{
	for (int i = u->ncols - 1; i >= 0; i--) {
		float bi = b[i];

		float diag = MATD_EL(u, i, i);

		for (int j = i + 1; j < u->ncols; j++)
			bi -= MATD_EL(u, i, j)*x[j];

		x[i] = bi / diag;
	}
}

