STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/matd.c
matd_t* matd_chol_solve(const matd_chol_t *chol, const matd_t *b)
{
	matd_t *u = chol->u;

	matd_t *x = matd_copy(b);

	// LUx = b

	// solve Ly = b ==> (U')y = b

	for (int i = 0; i < u->nrows; i++) {
		for (int j = 0; j < i; j++) {
			// b[i] -= L[i,j]*x[j]... replicated across columns of b
			//   ==> i.e., ==>
			// b[i,k] -= L[i,j]*x[j,k]
			for (int k = 0; k < b->ncols; k++) {
				MATD_EL(x, i, k)-= MATD_EL(u, j, i)*MATD_EL(x, j, k);
			}
		}
		// x[i] = b[i] / L[i,i]
		for (int k = 0; k < b->ncols; k++) {
			MATD_EL(x, i, k) /= MATD_EL(u, i, i);
		}
	}

	// solve Ux = y
	for (int k = u->ncols - 1; k >= 0; k--) {
		float LUkk = 1.0f / MATD_EL(u, k, k);	// STM32IPL: added f to the constant.
		for (int t = 0; t < b->ncols; t++)
			MATD_EL(x, k, t)*= LUkk;

		for (int i = 0; i < k; i++) {
			float LUik = -MATD_EL(u, i, k);
			for (int t = 0; t < b->ncols; t++)
				MATD_EL(x, i, t)+= MATD_EL(x, k, t) *LUik;
			}
		}

	return x;
}

/*void matd_chol_solve(matd_chol_t *chol, const TYPE *b, TYPE *x)
 {
 matd_t *u = chol->u;

 TYPE y[u->ncols];
 matd_ltransposetriangle_solve(u, b, y);
 matd_utriangle_solve(u, y, x);
 }
 */
// only sensible on PSD matrices. had expected it to be faster than
// inverse via LU... for now, doesn't seem to be.
matd_t* matd_chol_inverse(matd_t *a)
{
	assert(a->nrows == a->ncols);

	matd_chol_t *chol = matd_chol(a);

	matd_t *eye = matd_identity(a->nrows);
	matd_t *inv = matd_chol_solve(chol, eye);
	matd_destroy(eye);
	matd_chol_destroy(chol);

	return inv;
}

float matd_max(matd_t *m)
{
	float d = -FLT_MAX;
	for (int x = 0; x < m->nrows; x++) {
		for (int y = 0; y < m->ncols; y++) {
			if (MATD_EL(m, x, y)> d)
			d = MATD_EL(m, x, y);
		}
	}

	return d;
}

